{"backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "kernel_size": [3, 3], "padding": "same", "filters": 32, "bias_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_3", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_6", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_7", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_8", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "conv2d_9", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_10", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_11", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_12", "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "units": 512, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activation": "sigmoid", "units": 20, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential"}